Tekla.Structures.Filtering.BooleanConstantFilterExpression
The BooleanConstantFilterExpression class represents a constant Boolean filter expression.

Tekla.Structures.Filtering.BooleanConstantFilterExpression.#ctor(System.Boolean)
Initializes a new instance of the BooleanConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.BooleanConstantFilterExpression.#ctor(System.Boolean,System.IFormatProvider)
Initializes a new instance of the BooleanConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.